{
  "js": {
    "name": "JavaScript",
    "iconURL": "images/javascript-icon.svg",
    "documentation": "https://developer.mozilla.org/en-US/docs/Web/JavaScript",
    "description": "JavaScript is a high-level programming language primarily used for creating interactive web pages. It runs in the browser, allowing developers to manipulate content, handle events, and perform asynchronous tasks. It has also expanded to server-side development with platforms like Node.js."
  },
  "css": {
    "name": "CSS",
    "iconURL": "images/css-icon.svg",
    "documentation": "https://developer.mozilla.org/en-US/docs/Web/CSS",
    "description": "CSS (Cascading Style Sheets) is a style sheet language used to define the presentation of web pages. It controls layout, colors, and fonts, separating content from design. CSS supports responsive design through media queries, ensuring websites look good on different devices."
  },
  "html": {
    "name": "HTML",
    "iconURL": "images/html-icon.svg",
    "documentation": "https://developer.mozilla.org/en-US/docs/Web/HTML",
    "description": "HTML (HyperText Markup Language) is the standard language for structuring web pages. It uses elements like headings, paragraphs, and links to define content, serving as the backbone of web development alongside CSS and JavaScript."
  },
  "git": {
    "name": "Git",
    "iconURL": "images/git-icon.svg",
    "documentation": "https://git-scm.com/doc",
    "description": "Git is a distributed version control system that tracks changes in source code, enabling collaboration among developers. It features branching, merging, and a complete history of changes, often used with platforms like GitHub for remote repositories."
  },
  "java": {
    "name": "Java",
    "iconURL": "images/java-icon.svg",
    "documentation": "https://docs.oracle.com/en/java/javase/23/",
    "description": "Java is a high-level, object-oriented programming language known for its portability, security, and performance. Designed to run on any device with the Java Virtual Machine (JVM), it’s widely used for building web applications, mobile applications (especially Android), and large enterprise systems. Java's robust ecosystem includes frameworks like Spring and tools for building scalable software."
  },
  "kotlin": {
    "name": "Kotlin",
    "iconURL": "images/kotlin-icon.svg",
    "documentation": "https://kotlinlang.org/docs/home.html",
    "description": "Kotlin is a modern, statically typed programming language that runs on the Java Virtual Machine (JVM). Developed by JetBrains, it is fully interoperable with Java and is known for its concise syntax and safety features, such as null safety. Kotlin is widely used for Android development, offering improved productivity and a more expressive code style compared to Java."
  },
  "react": {
    "name": "React",
    "iconURL": "images/react-icon.svg",
    "documentation": "https://react.dev/reference/react",
    "description": "ReactJS is a JavaScript library for building user interfaces, particularly single-page applications. Developed by Facebook, it allows developers to create reusable UI components, efficiently update the DOM using a virtual DOM, and manage application state. React promotes a declarative approach, making it easier to understand and debug UI interactions."
  },
  "intellij": {
    "name": "IntelliJ IDEA",
    "iconURL": "images/intellij-icon.svg",
    "documentation": "https://www.jetbrains.com/help/idea/getting-started.html",
    "description": "IntelliJ IDEA is an integrated development environment (IDE) for Java and other programming languages, developed by JetBrains. It offers powerful coding assistance, debugging tools, and support for version control systems. Known for its intelligent code completion and robust refactoring capabilities, IntelliJ enhances developer productivity and is popular for building enterprise applications, web services, and Android apps."
  }
}
